// 아기정보 메인 함수
function getbabyMsg(msg) {
    let result;

    if(msg.startsWith(".아동 부모급여")){
        result="[안내]\n부모급여는 0세 아동(0~11개월)에게는 매월 100만원,\n1세 아동(11~23개월)에게는 매월 50만원이 지원됩니다. \n이는 아동 양육에 따른 경제적 부담을 줄이고 \n아동의 기본적 권리와 복지를 증진하기 위한 정책으로, \n대한민국 국적을 가진 만 2세 미만 아동이 대상입니다."
         
        result+="\n\n[조건]\n"
        result+="대한민국 국적을 취득한 아동\n만 2세 미만 아동으로 국내에 거주 중인 재외국민 및 복수국적자 포함"

        result+="\n\n[필요 서류 및 구비 서류]\n"
        result+="신청자 신분증\n영아수당 신청서 또는 아동수당 신청서\n기본증명서, 가족관계증명서 사본\n외국여권 및 국내여권 사본 1부"
    
        result+="\n\n[신청방법]\n"
        result+="1.온라인\n복지로 웹사이트(http://www.bokjiro.go.kr) 또는 모바일 ‘복지로’ 앱으로 신청할 수 있습니다."
        result+="2.오프라인\n보호자 또는 대리인이 아동의 주민등록 상 주소지 읍면동 주민센터에 신청합니다."
    }
    if(msg.startsWith(".아동 첫만남이용권")){
        result="[안내]\n출생 아동에게 첫만남 이용권 200만원 이상을 지급하여 \n생애초기 아동양육에 따른 경제적 부담 경감"

        result+="\n\n[조건]\n"
        result+="출생아로서 출생신고되어 정상적으로 주민등록번호를 부여받은 아동(주민등록상 생년월일로부터 1년이 초과되지 않은 출생아)\n\n단 아동 출생일(주민등록일상 생년월일)로 부터 1년 경과시 바우처 신청 불가"

        result+="\n\n[지원내용]\n"
        result+="출생아당 200만원 이상의 이용권"

        result+="\n\n[필요 서류 및 구비 서류]\n"
        result+="신청자 신분증\n사회보장급여(사회서비스이용권) 신청(변경)서」(서식1)\n\n\단, 보호자인 부모가 출산 지원 서비스를 한번에 신청하는 경우 「출산서비스 통합처리신청서」(서식3) 활용 가능"
    
        result+="\n\n[신청방법]\n"
        result+="1.온라인\n복지로 웹사이트(http://www.bokjiro.go.kr) 또는 모바일 ‘복지로’ 앱으로 신청할 수 있습니다."
        result+="2.오프라인\n보호자 또는 대리인이 아동의 주민등록 상 주소지 읍면동 주민센터에 신청합니다."
    }
    if(msg.startsWith(".아동 아동수당")){
        result="[안내]\n아동에게 아동수당을 지급하여 아동 양육에 따른 경제적 부담을 경감하고\n건강한 성장환경을 조성함으로써 아동의 기본적 권리와 복지를 증진"

        result+="\n\n[조건]\n"
        result+="만 8세 미만 모든 아동\n현금입금 원칙 (시군구 조례로 정하는 경우 지역상품권으로도 지급가능)"

        result+="\n\n[지원내용]\n"
        result+="신청일이 속하는 달부터 매달 25일에 대상 아동 1인당 10만원이 지급"

        result+="\n\n[필요 서류 및 구비 서류]\n"
        result+="신청자 신분증\n아동수당 지급 신청서"
        result+="\n\n[신청방법]\n"
        result+="1.온라인\n복지로 웹사이트(http://www.bokjiro.go.kr) 또는 모바일 ‘복지로’ 앱으로 신청할 수 있습니다."
        result+="2.오프라인\n보호자 또는 대리인이 아동의 주민등록 상 주소지 읍면동 주민센터에 신청합니다."
    }
    if(msg.startsWith(".아동 임신바우처")){
        result="[안내]\n건강한 태아의 분만과 산모의 건강관리, /n출산친화적 환경 조성을 위해 임신 및 출산과 관련된 진료비를 /n전자바우처(국민행복카드) 로 일부 지원하는 제도"

        result+="\n\n[조건]\n"
        result+="임신확인서로 임신이 확진된 건강보험 가입자 또는 /n피부양자 중 임신·출산 진료비 지원 신청자"

        result+="\n\n[지원내용]\n"
        result+="임신 1회당 100만원 이용권(국민행복카드)지원/n(다태아 임산부는 140만원,분만취약지점 20만원 추가지원)"

        result+="\n\n[필요 서류 및 구비 서류]\n"
        result+="신청자 신분증\n「건강보험 임신․출산 진료비 지원신청 및 임신확인서"
        result+="\n\n[신청방법]\n"
        result+="오프라인은 건강검진공단에 신청/n온라인은 검색해볼것것"
    }
    if(msg.startsWith(".아동 출산지원금")){
        result="[출산지원금 - 단태아기준]"

        result+="\n\n[부모급여]\n"
        result+="월 현금 100만원 1세부터는 50만원 총 2년"

        result+="\n\n[첫만남이용권]\n"
        result+="1회 200만원 바우처지급"

        result+="\n\n[아동수당]\n"
        result+="월 10만원, 8세까지"

        result+="\n\n[임신바우처]\n"
        result+="임신 1회당 100만원 이용권"

        
        result+="\n\n[합계]\n"
        result+="바우처: 300만원 / 현금 월 110만원"

    }
    result+="\n\n[주의사항]\n"
    result+="시마다 다를 수 있으니 반드시 알아보세요."

    return result;
}


// export 데이터
exports.getbabyMsg = getbabyMsg;
