//간사이 공항 라피트 시간표 평일
const kansai_rapit_times = [
    '6:53', '7:30', '7:58', '8:35', '9:03', '9:34', '10:05', '10:36', '11:05', '11:35',
    '12:05', '12:35', '13:05', '13:35', '14:05', '14:35', '15:05', '15:35', '16:05', '16:35',
    '17:05', '17:35', '18:05', '18:36', '19:05', '19:36', '20:05', '20:36', '21:06', '21:35',
    '22:01', '22:35', '23:00'
];
//간사이 공항 난카이선 시간표 평일
const kansai_times = [
    '5:45', '6:14', '6:37', '6:53', '6:57', '7:11', '7:24', '7:30', '7:47', '7:58',
    '8:02', '8:20', '8:27', '8:35', '8:43', '8:54', '9:03', '9:14', '9:27', '9:34',
    '9:44', '9:56', '10:05', '10:12', '10:26', '10:36', '10:39', '10:56', '11:05', '11:10',
    '11:26', '11:35', '11:39', '11:56', '12:05', '12:09', '12:26', '12:35', '12:39', '12:56',
    '13:05', '13:09', '13:26', '13:35', '13:39', '13:56', '14:05', '14:09', '14:26', '14:35',
    '14:39', '14:56', '15:05', '15:09', '15:26', '15:35', '15:39', '15:56', '16:05', '16:09',
    '16:26', '16:35', '16:39', '16:56', '17:05', '17:13', '17:27', '17:35', '17:39', '17:54',
    '18:05', '18:14', '18:36', '18:44', '18:55', '19:05', '19:22', '19:36', '19:43', '19:54',
    '20:05', '20:14', '20:26', '20:36', '20:43', '21:06', '21:14', '21:28', '21:35', '21:44',
    '21:54', '22:01', '22:13', '22:25', '22:35', '22:48', '23:00', '23:20', '23:55'
];
//간사이 공항 라피트 시간표 주말
const week_kansai_rapit_times = [
    '7:06', '7:31', '8:04', '8:35', '9:05', '9:35', '10:05', '10:35', '11:05', '11:35',
    '12:05', '12:35', '13:05', '13:35', '14:05', '14:35', '15:05', '15:35', '16:05', '16:35',
    '17:05', '17:35', '18:04', '18:34', '19:04', '19:35', '20:05', '20:35', '21:05', '21:34',
    '22:05', '22:32', '22:55'
];
//간사이 공항 난카이선 시간표 주말
const week_kansai_times = [
    '5:47', '6:14', '6:44', '7:15', '7:38', '7:53', '8:22', '8:41', '8:54', '9:13',
    '9:43', '10:11', '10:24', '10:39', '10:53', '11:10', '11:26', '11:39', '11:56', '12:09',
    '12:26', '12:39', '12:56', '13:09', '13:26', '13:39', '13:56', '14:09', '14:26', '14:39',
    '14:56', '15:09', '15:26', '15:39', '15:56', '16:09', '16:26', '16:39', '16:56', '17:09',
    '17:27', '17:39', '17:56', '18:09', '18:26', '18:39', '18:56', '19:09', '19:26', '19:39',
    '19:56', '20:09', '20:26', '20:39', '20:56', '21:09', '21:27', '21:39', '21:56', '22:09',
    '22:23', '22:35', '23:00', '23:18', '23:55'
];
// 나리타 스카이라이너 시간표 평일
const narita_times = [
    '7:23', '8:12', '9:07', '9:36', '9:53', '10:19', '10:33', '10:59', '11:13', '11:39',
    '11:59', '12:13', '12:39', '12:59', '13:13', '13:39', '13:59', '14:13', '14:39', '14:59',
    '15:13', '15:39', '15:59', '16:13', '16:39', '16:59', '17:19', '17:39', '17:59', '18:15',
    '18:40', '19:00', '19:20', '19:40', '20:00', '20:30', '21:00', '21:20', '21:40', '22:00',
    '22:20', '22:40', '23:00'
];
// 나리타 스카이라이너 시간표 주말
const week_narita_times = [
    '7:30', '8:29', '9:19', '9:39', '9:53', '10:16', '10:33', '10:59', '11:13', '11:39',
    '11:59', '12:13', '12:39', '12:59', '13:13', '13:39', '13:59', '14:13', '14:39', '14:59',
    '15:13', '15:39', '15:59', '16:13', '16:39', '16:58', '17:15', '17:39', '17:59', '18:15',
    '18:39', '18:59', '19:19', '19:39', '20:00', '20:30', '21:00', '21:20', '21:40', '22:00',
    '22:20', '22:40', '23:00'
];

// 공항 전철 시간표
function getUpcomingTrains(msg) {

    // 질문
    cmd = msg.substr(3);

    // 역 이름
    let station;
    
    // 지역 이름
    let area;

    // 급행여부
    let nomal;
    let express;

    // 결과값
    let result;
    

    // 어느공한인지
    if(msg.startsWith(".간사이")){
        station="난카이선 간사이공항역";
        area="kansai";
    }else if(msg.startsWith(".나리타")){
        station="나리타공항 제1터미널";
        area="narita";
    }

    //현재 시간 가져오기
    const currentTime = new Date();
    // 현재 시간을 HH:mm 형식으로 변환
    const now = currentTime.getHours().toString().padStart(2, '0') + ':' + currentTime.getMinutes().toString().padStart(2, '0');

    // 현재 시간에서 1시간 후 계산
    const oneHourLater = new Date(currentTime.getTime() + 60 * 60 * 1000);
    const maxTime = oneHourLater.getHours().toString().padStart(2, '0') + ':' + oneHourLater.getMinutes().toString().padStart(2, '0');

    // 주말인지 체크
    const day = currentTime.getDay();
    const isWeekday = day !== 0 && day !== 6;

    if (!isWeekday) {

        // 간사이공항
        if(area =="kansai"){
            nomal = kansai_times.filter(time => {
                return time >= now && time <= maxTime;
            });
            express = kansai_rapit_times.filter(time => {
                return time >= now && time <= maxTime;
            });
            result="["+station+"(주말)] \n[현재시간] : "+now+"\n\n[급행열차] : "+nomal+"\n[라피트 열차]: "+express;

        // 나리타
        }else if(area =="narita"){
            nomal = narita_times.filter(time => {
                return time >= now && time <= maxTime;
            });
            result="["+station+"(주말)] \n[현재시간] : "+now+"\n\n[스카이라이너] : "+nomal;
        }

    }else{

        // 간사이공항
        if(area =="kansai") {
            nomal = week_kansai_times.filter(time => {
                return time >= now && time <= maxTime;
            });
            express = week_kansai_rapit_times.filter(time => {
                return time >= now && time <= maxTime;
            });
            result = "[" + station + "(평일)] \n[현재시간] : " + now + "\n\n[급행열차] : " + nomal + "\n[라피트 열차]: " + express;

        // 나리타
        }else if(area =="narita"){
            nomal = week_narita_times.filter(time => {
                return time >= now && time <= maxTime;
            });
            result = "[" + station + "(평일)] \n[현재시간] : " + now + "\n\n[스카이라이너] : "+nomal;
        }
    }
    return result;
}

exports.getUpcomingTrains = getUpcomingTrains;
